// 1 задание
// Объяви переменную price и присвой ей значение 100. Затем измени значение price на 150 и выведи его
// в консоль;

let price = 100;
price = 150;

console.log(price)

// 2 задание
// Попробуй повторно объявить переменную с помощью let и const. Объясни своими словами*, что 
// произошло. 

let price = 110;
const price = 120;

/*
Повторное объявление переменной price с помощью let и const приводит к синтаксической ошибке
Переопределить переменную, объявленную с помощью let можно
Переопределять переменную, объявленную с помощью const нельзя
*/