// 1. Есть массив чисел. Преобразуй массив так, чтобы там были квадраты чисел. 
// Пример: [2, 3] -> [4, 9];

let squaresArray = [2, 3];
squaresArray = squaresArray.map(num => num * num);
console.log(squaresArray);

// 2. Есть массив c повторяющимися элементами. 
// Отфильтруй массив так, чтобы там остались только уникальные элементы. 
// Пример: [1, 2, 2, 3, 4, 5, 5, 5, 6] -> [1, 2, 3, 4, 5, 6];

// 3. Есть массив чисел, посчитай сумму его элементов. 
// Пример: [1, 2, 3] -> 6. Подсказка: используй reduce;

// 4. Напиши программу, которая развернет массив, то есть все элементы будут в обратном порядке. 
// Нельзя использовать reverse()!

// 5. Создай две переменных - две строки с использованием let и const. 
// Попробуйте изменить значения всех этих переменных. 
// Создайте два массива с использованием let и const. 
// Попробуйте изменить массивы (добавить и удалить элементы) и переопределить сами массивы. 
// Посмотри на результаты и объясни своими словами (да, опять🙂), что и почему так произошло.
