// 1 задание
// Создай переменные для хранения своего города и температуры воздуха в нем на сегодняшний день. 
// Используй эти переменные для вывода информации о своем городе в консоль;

const myCity = 'Санкт-Петербург'; // объявление и присваивание переменной для хранения своего города
let airTemperature = 17; // объявление и присваивание переменной для хранения емпературы воздуха в городе на сегодняшний день

console.log(`Город: ${myCity}\nТемпература воздуха: ${airTemperature}`); // вывод результата

// 2 задание
// Напиши выражение, которое вычисляет сумму двух чисел и умножает результат на третье число. 
// Выведи результат в консоль;

const firstNumber = 6; // объявление и присваивание переменной для хранения первого числа
const secondNumder = 99; // объявление и присваивание переменной для хранения второго числа
const thirdNumber = 3; // объявление и присваивание переменной для хранения третьего числа

const result = (firstNumber + secondNumder) * thirdNumber // объявление и присваивание переменной выражению

console.log('Результат выражения: ', result) // вывод результата