// 1. Напиши функцию, которая принимает строку и проверяет, является ли она палиндромом. 
// Если да - функция возвращает true, если нет - false;

// 2. Напиши функцию, которая принимает строку (предложение) 
// и находит первое самое короткое слово в ней и возвращает его;

// 3. Напиши функцию, которая форматирует строку с цифрами в телефонный номер. 
// Пример: createPhoneNumber(123456789) → 8 (123) 456-789;

// 4. Напиши функцию, которая ищет минимальное и максимальное значение в массиве;

// 5. *Напиши функцию, которая на вход принимает массив, а на выходе возвращает новый, 
// отсортированный в порядке возрастания, массив. 