// 1. Найди элемент на странице по его ID и измени его текстовое содержимое на что-то новое;

// 2. Используй JavaScript, чтобы изменить фон и цвет текста элемента с определенным классом;

// 3. Напиши код, который создает новый параграф с текстом и добавляет его в конец документа;

// 4. Напиши функцию, которая удаляет элемент с указанным ID из документа;

// 5. Измени атрибут ссылки на новый URL и выведи его значение в консоль;

// 6. Создай новый элемент, добавь к нему класс и добавь его в DOM;

// 7. Переключи класс у существующего элемента и проверьте его наличие в консоли.